app/controllers/addresses_controller.rb

DELETE FROM "addresses" WHERE "addresses"."id" = $1  [["id", 2]]
---
  def destroy
    @address.destroy!