app/controllers/weathers_controller.rb

SELECT "weathers".* FROM "weathers"
---
  def index
    @weathers = params[:weathers].blank? ? Weather.all : JSON.parse(params[:weathers]).map { |w| Weather.new(w) }

SELECT "weathers".* FROM "weathers" WHERE "weathers"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_weather
      @weather = Weather.find(params[:id])